# python 会将集合放在一对大括号中，相邻元素之间使用","分隔, 集合中的数据可以是任意不可变类型(字符串，数字, 元组)
# 注意：不能是列表和字典，因为这两者可变
set1 = {"http://www.baidu.com", 20, (1, 2, 3, 4, 5)}
print(set1) # 输出：{20, (1, 2, 3, 4, 5), 'http://www.baidu.com'}, 输出的顺序可能有变化, 因为set集合是无序的

# set 集合中不允许存放可变类型数据, 如字典
# set1 = {{'OG':"ana"}}
# print(set1) # 输出：会报：TypeError: unhashable type: 'dict'

# set 集合中如果有重复的元素，将只会保留一次
set1 = {1, 2, 3, 4, 1}
print(set1) # 输出：{1, 2, 3, 4}， 1只会输出一次

#=========================================================
#                       创建 set 集合
#=========================================================

# 使用{}创建
a = {1, 'c', 1, (1, 2, 3), 'c'}
print(a) # 输出：{'c', 1, (1, 2, 3)}

# 使用set()函数创建集合, set()函数是python的内置函数，可以将字符串、列表、元组、range对象转换为集合
set1 = set("http://www.baidu.com")
set2 = set([1, 2, 3, 4, 5])
set3 = set((1, 3, 5, 7, 9))
set4 = set(range(5))

print(set1) # 输出：{'a', 'p', '/', ':', 'u', '.', 'c', 'h', 't', 'd', 'w', 'o', 'm', 'i', 'b'}
print(set2) # 输出：{1, 2, 3, 4, 5}
print(set3) # 输出：{1, 3, 5, 7, 9}
print(set4) # 输出：{0, 1, 2, 3, 4}


#=========================================================
#                      访问set集合元素
#=========================================================
print("---------------------------------------")
# set集合中的元素是无序的，因为无法像列表那样通过下标访问元素，python中访问set集合元素常用的方法是使用循环结构，将集合中的数据逐一读出
a = {1, 'c', 1, (1, 2, 3), 'c'}
for i in a:
    print(i)

'''
输出：
1
(1, 2, 3)
c
'''

#=========================================================
#                      删除set集合
#=========================================================
a = {1,'c',1,(1,2,3),'c'}
print(a)
del(a)
print(a)

'''
输出：
{1, 'c', (1, 2, 3)}
    print(a)
NameError: name 'a' is not defined
'''


