# 可以给python函数的参数指定一个默认值，这样在调用函数时，就不需要将所有的参数全部写完，有点类似于C++

def calculate_result(arg1, arg2 = 5):
    '''
    计算两个参数的和，如果第二个参数不传的话，默认值是5
    '''
    return arg1 + arg2


# 计算2 + 3 的和
print(calculate_result(20, 34)) # 输出 54

# 计算 1 + 5 的和，注意：第二个参数我没有传
print(calculate_result(1))     # 输出 6


'''
注意：当使用默认参数时，默认参数必须位于参数列表的结果，像下面的写法是不对的：

def calculate_result(arg2 = 5, arg1):
    return arg2 + arg1

'''


#============================================================
#                       查看函数的默认值
#============================================================

# 可以通过 函数名.__defaults__ 查看函数的默认参数值，该函数会返回一个元组

print(calculate_result.__defaults__) # 输出：(5,)